[
    {
        "id": 1,
        "title": "[AI] Rupiah Detector using K-NN",
        "slug": "ai-rupiah-detector-using-knn",
        "category": "AI",
        "description": "<p><span class='subtitle'>Summary Project</span>Proyek deteksi nilai rupiah pada uang kertas yang dibuat menggunakan bahasa python dalam tahap pembuatannya. Bahasa python dipilih dikarenakan terdapat library yang membantu dalam tahap pengerjaan seperti <i>opencv, skimage, matplotlib,</i> dan <i>numpy</i>. Deteksi dilakukan dengan cara mengambil gambar nominal pada nilai rupiah dan menggunakan metode morfologi, segmentasi, dan <i>thresholding</i> untuk disesuaikan dengan dengan data yang dilatih. Data yang dilatih, dibagi dalam 8 kategori dengan menggunakan metode K-NN untuk melatih data tersebut. Alasan penggunaan algoritma K-NN adalah karena algoritma K-NN lebih sederehana untuk dilakukan dibandingkan algoritma lainnya tetapi mampu untuk menghasilkan akurasi klasifikasi yang tidka buruk.</p><p>Tujuan dari proyek deteksi nilai rupiah pada uang kertas ini adalah untuk membantu peningkatan fasilitas pada bidang transportasi atau industri seperti menyortir uang secara otomatis atau dapat diimplementasi pada vending machine untuk mengetahui uang yang dimasukkan oleh pengguna.</p><p><span class='subtitle'>Algoritma K-NN</span>Algoritma <i>K-Nearest Neighbor</i> adalah algoritma <i>supervised learning</i>. <i>Supervised learning</i> adalah suatu metode pengklasifikasian dimana kita sudah memilijki data yang telah dikelompokkan atau dilabelkan terlenbih dahulu. Sedangkan untuk K-NN sendiri berfokus mengambil tetangga terdekat berdasarkan nilai K yang kita atur. Gambar dibawah merupakan ilustrasi cara kerja algoritma K-NN. pada gambar tersebut terdapat 15 data dan 1 data yang baru ditambahkan. Dapat terlihat, 15 data sudah ditraining terlebih dahulu sehingga sudah terklasifikasi menjadi 2 kubu. Saat data ke 16 dimasukkan dan jika K = 3, maka data ke 16 lebih condong ke arah kubu segitiga hijau. Namun apabila K = 7 maka akan menghasilkan data lebih condong ke bintang merah.<img src='/assets/work/rupiah-detector-knn/knn-theory.png' /></p><p><span class='subtitle'>Project Demo Explanation</span>Data gambar uang kami kumpulkan secara manual dengan memfoto uang dengan angle, brightness, keadaan uang, yang berbeda. Setelah itu, data kami kelompokkan dalam masing masing folder. Folder-folder tersebut kami olah agar setiap gambar menghasilkan nilai HSV (Hue Saturation Value). Nilai HSV tersebut kami representasikan dalam bentuk grafik seperti pada gambar dibawah.<img src='/assets/work/rupiah-detector-knn/knn-demo.png' />Terlihat pada grafik tersebut, terdapat satu data uji berbentuk kotak hitam yang akan diklasifikasikan. Dengan metode K-NN kita tinggal mengecek jarak antara titik titik tersebut berdasarkan nilai K.</p>",
        "image": "/assets/work/rupiah-detector-knn/cover.png",
        "isHighlight": true,
        "createdAt": "2025-03-15T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 2,
        "title": "[Web] Curug Sangereng Village",
        "slug": "web-curug-sangereng-village",
        "category": "Development",
        "description": "<p>Website Desa Curug Sangereng merupakan proyek pengabdian masyarakat yang diinisiasi oleh Universitas Multimedia Nusantara. Dalam proyek ini, penulis berperan sebagai backend developer bekerja sama dengan satu frontend developer dan tim lainnya dalam mengumpulkan asset yang diperlukan. Website ini dibuat dalam kurun waktu kurang lebih 3 bulan mulai dari tahap pengumpulan informasi sampai tahap presentasi demo website kepada pemangku desa.</p><p>Website Desa Curug Sangereng ini dibentuk dengan stack tech sebagai berikut:</p><ul><li>Nuxt 2 sebagai tampilan website baik tampilan desktop maupun mobile</li><li>Laravel 9 sebagai penyedia API dan pengelolaan data baik website maupun CMS</li><li>PhpMyAdmin (MySQL) sebagai sistem manajemen basis data</li><li>RumahWeb sebagai penyedia layanan hosting dan domain</li></ul><p>Website Desa Curug Sangereng dibuat untuk memudahkan masyarakat desa dalam mengakses informasi baik terkait data wilayah, layanan desa, usaha, galeri desa dan lain sebagainya. Berikut halaman awal website Ketika mengakses link berikut <a href='https://curugsangereng.id/'>https://curugsangereng.id/</a></p><img src='/assets/work/web-curug-sangereng/web-curug-sangereng-village-home.jpg' /><div class='desc-2-col'><div class='desc-2-col-left'><p>Content Management System atau CMS juga dibuat untuk membantu pengguna dalam mengelola menu, data, dan asset yang akan ditampilkan pada website. CMS juga dibuat menggunakan Nuxt 2. Halaman login page untuk mengakses CMS dapat dilihat pada gambar di samping.</p></div><div class='desc-2-col-right'></div></div>",
        "image": "/assets/work/web-curug-sangereng/cover.png",
        "isHighlight": true,
        "createdAt": "2025-02-27T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 3,
        "title": "[Web] Visitory",
        "slug": "web-visitory",
        "category": "Development",
        "description": "<p><span class='subtitle'>What is Visitory?</span>Visitory merupakan jasa tour guide yang dapat dipesan secara real time dengan pilihan destinasi menarik yang dapat dipilih oleh pelanggan. Visitory memberikan berbagai variasi destinasi serta artikel yang membantu pelanggan menyusun rencana berlibur bersama Visitory.</p><p><span class='subtitle'>Penjelasan Teknikal Website</span>Website Visitory terdiri dari dua proses, yaitu proses Customer dan proses Admin. Proses customer dapat melakukan pencarian referensi destinasi, autentikasi akun, order pesanan destinasi. Sedangkan proses Admin dapat melakukan pemeliharaan website serta memproses order pesanan dari customer.Berikut Tech Stack Website Visitory:<ul><li>Laravel Framework v.9.19 (MVC Concept)</li><li>XAMPP MySQL untuk database</li><li>Deployed on NiagaHoster (already expired)</li></ul></p><br/><p><span class='subtitle'>Dokumentasi Customer Proses</span><figure><img src='/assets/work/web-visitory/login.png' width='300'/><figcatpion>Halaman Login</figcatpion></figure><figure><img src='/assets/work/web-visitory/home.png'/><figcatpion>Halaman Utama</figcatpion></figure><figure><img src='/assets/work/web-visitory/budget_level.png'/><figcatpion>Halaman Budgeting Level</figcatpion></figure><figure><img src='/assets/work/web-visitory/destination.png'/><figcatpion>Halaman Destinasi</figcatpion></figure><figure><img src='/assets/work/web-visitory/article.png'/><figcatpion>Halaman Artikel</figcatpion></figure><figure><img src='/assets/work/web-visitory/order.png'/><figcatpion>Halaman Order</figcatpion></figure><figure><img src='/assets/work/web-visitory/tiket.png'/><figcatpion>Halaman Tiket</figcatpion></figure><figure><img src='/assets/work/web-visitory/profile.png'/><figcatpion>Halaman Profile</figcatpion></figure></p><p><span class='subtitle'>Dokumentasi Admin Proses</span><figure><img src='/assets/work/web-visitory/dashboard.png'/><figcatpion>Halaman Admin</figcatpion></figure></p>",
        "image": "/assets/work/web-visitory/cover.png",
        "isHighlight": true,
        "createdAt": "2025-03-19T12:36:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 4,
        "title": "[CMS] Blazor WASM Boilerplate",
        "slug": "cms-blazor-wasm-boilerplate",
        "category": "Development",
        "description": "<p>CMS boilerplate ini dibuat menggunakan Blazor WebAssembly (Blazor WASM). Blazor WASM adalah framework frontend berbasis .NET yang memungkinkan developer membangun web CMS interaktif menggunakan C#. Aplikasi Blazor WASM berjalan langsung di browser menggunakan WebAssembly.</p></br><p>Keuntungan menggunakan Blazor WASM untuk proyek CMS:</p><ul><li>Dikarenakan berbasis C#, kita dapat dengan mudah membuat backend services digabung pada Blazor WASM atau .NET Core terpisah</li><li>Blazor bersifat component base. Sehingga komponen yang dibuat dapat digunakan kembali pada page lain.</li><li>Performa setelah dibuka pertama kali sangat baik</li><li>Kemudahan Go Public karena bisa dideploy di Vercel, Netlify, dan layanan cloud lainnya</li></ul></br><p>Kekurangan menggunakan Blazor WASM untuk proyek CMS:</p><ul><li>Pertama kali dibuka memerlukan waktu dikarenakan menggunakan WASM yang berjalan langsung di browser. Sehingga perlu mendownload data yang diperlukan</li><li>Dokumentasi yang terbilang masih sedikit dibandingkan framework frontend yang lain</li></ul></br><p>Dashboard CMS berisi header dan juga card yang dapat digunakan untuk menyampaikan informasi. Selain itu tabel yang digunakan menggunakan package QuickGrid yang dapat dilihat pada gambar di bawah ini.</p><img src='/assets/work/cms-blazor-wasm-boilerplate.png' /><p>Selain itu juga terdapat sidebar menu, yang berisi beberapa komponen seperti user management, role management, category management, upload file. Untuk login page masih dalam tahap pengembangan yang akan diupdate segera.</p>",
        "image": "/assets/work/cms-blazor-wasm-boilerplate/cover.png",
        "isHighlight": true,
        "createdAt": "2025-03-04T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 5,
        "title": "[Thesis] Paddy Disease Classification using Ensemble Deep Learning",
        "slug": "thesis-paddy-disease-classification-using-ensemble-deep-learning",
        "category": "AI",
        "description": "<p><span class='subtitle'>Ringkasan Singkat</span>Skripsi ini dibuat dengan latar belakang padi sebagai komoditas pangan penting tetapi terdapat penurunan jumlah produksi padi diakibatkan beragam jenis penyakit padi yang menyulitkan petani dalam melakukan identifikasi dini. Dengan bantuan teknologi terkini seperti deep learning dan ensemble learning, dapat membantu mengekstrak fitur, menganalisa, dan mengidentifikasi penyakit pada tanaman padi.</p><p><span class='subtitle'>Ringkasan Teknis</span>Sistem pada skripsi ini dibuat dengan spesifikasi teknologi sebagai berikut:<ul><li>Google Colab Pro untuk memproses dataset serta melatih model</li><li>Paddy Doctor Datase diambil dari Kaggle sebagai dataset utama</li><li>Pretrained Model meliputi EfficientNetV2B0 dan MobileNetV3-Large</li><li>Ensemble Learning meliputi Average Ensemble dan Concatenate Ensemble</li><li>NuxtJS 2 sebagai framework tampilan PWA</li><li>FastAPI sebagai framework backend yang menjalankan h5 model hasil training</li></ul></p><p>Berikut Skripsi lengkap saya terkait proyek ini:</p><div style='height:100vh;overflow:hidden;'><iframe src='/assets/work/paddy-disease/Skripsi_RichardAlvinPratama.pdf' style='width:100%;height:100%;border:none;max-width:100vw;max-height:100vh;'></iframe></div>",
        "image": "/assets/work/paddy-disease/cover.png",
        "isHighlight": false,
        "createdAt": "2025-04-09T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 6,
        "title": "[Web] GroupIn with Laravel MVC",
        "slug": "web-groupin-with-laravel-mvc",
        "category": "Development",
        "description": "on progress...",
        "image": "/assets/work/web-groupin-with-laravel-mvc/cover.png",
        "isHighlight": false,
        "createdAt": "2025-02-27T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 7,
        "title": "[Bangkit] IOH Chat App by Red Team",
        "slug": "bangkit-ioh-chat-app-by-red-team",
        "category": "Other",
        "description": "on progress...",
        "image": "",
        "isHighlight": false,
        "createdAt": "2025-02-27T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 8,
        "title": "[IOT] Ghorilard",
        "slug": "iot-ghorilard",
        "category": "Other",
        "description": "on progress ghorilard",
        "image": "/assets/work/iot-ghorilard/cover.jpg",
        "isHighlight": false,
        "createdAt": "2025-02-27T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    },
    {
        "id": 9,
        "title": "[Web] Order Progress Tracker with Laravel",
        "slug": "web-order-progress-tracker-with-laravel",
        "category": "Development",
        "description": "on progress shop services progress tracker",
        "image": "",
        "isHighlight": false,
        "createdAt": "2025-02-27T10:30:00Z",
        "createdBy": "Richard Alvin",
        "updatedAt": ""
    }
]